Revit 2024 API
SpecTypeId.LuminousIntensity Property
 Luminous Intensity, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId LuminousIntensity { get; }
Visual Basic
Public Shared ReadOnly Property LuminousIntensity As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ LuminousIntensity {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace